package com.oplus.pay.opensdk.statistic.model;

import com.oplus.utrace.db.UTraceSQLiteHelperKt;
import kotlin.Metadata;
import org.jetbrains.annotations.NotNull;

/* JADX INFO: loaded from: D:\项目\oppo通知转发\analysis\health667-dex\classes8.dex */
@Metadata(d1 = {"\u0000\u0012\n\u0002\u0018\u0002\n\u0002\u0010\u0010\n\u0000\n\u0002\u0010\u000e\n\u0002\b+\b\u0086\u0001\u0018\u00002\b\u0012\u0004\u0012\u00020\u00000\u0001B\u0017\b\u0002\u0012\u0006\u0010\u0002\u001a\u00020\u0003\u0012\u0006\u0010\u0004\u001a\u00020\u0003¢\u0006\u0002\u0010\u0005R\u0011\u0010\u0004\u001a\u00020\u0003¢\u0006\b\n\u0000\u001a\u0004\b\u0006\u0010\u0007R\u0011\u0010\u0002\u001a\u00020\u0003¢\u0006\b\n\u0000\u001a\u0004\b\b\u0010\u0007j\u0002\b\tj\u0002\b\nj\u0002\b\u000bj\u0002\b\fj\u0002\b\rj\u0002\b\u000ej\u0002\b\u000fj\u0002\b\u0010j\u0002\b\u0011j\u0002\b\u0012j\u0002\b\u0013j\u0002\b\u0014j\u0002\b\u0015j\u0002\b\u0016j\u0002\b\u0017j\u0002\b\u0018j\u0002\b\u0019j\u0002\b\u001aj\u0002\b\u001bj\u0002\b\u001cj\u0002\b\u001dj\u0002\b\u001ej\u0002\b\u001fj\u0002\b j\u0002\b!j\u0002\b\"j\u0002\b#j\u0002\b$j\u0002\b%j\u0002\b&j\u0002\b'j\u0002\b(j\u0002\b)j\u0002\b*j\u0002\b+j\u0002\b,j\u0002\b-¨\u0006."}, d2 = {"Lcom/oplus/pay/opensdk/statistic/model/TransactionProcessStatusCodes;", "", UTraceSQLiteHelperKt.COL_STATUS_CODE, "", "desc", "(Ljava/lang/String;ILjava/lang/String;Ljava/lang/String;)V", "getDesc", "()Ljava/lang/String;", "getStatusCode", "CODE_00_000_0000", "CODE_00_000_0001", "CODE_00_000_0002", "CODE_00_000_0003", "CODE_00_000_0004", "CODE_00_000_0005", "CODE_00_000_0006", "CODE_00_000_0007", "CODE_00_000_0008", "CODE_00_000_0009", "CODE_00_000_00010", "CODE_00_000_00011", "CODE_00_000_00012", "CODE_00_000_0013", "CODE_00_000_0014", "CODE_00_000_0015", "CODE_00_000_0016", "CODE_00_000_0017", "CODE_00_000_0018", "CODE_00_000_0019", "CODE_00_000_0020", "CODE_00_000_0021", "CODE_00_000_0022", "CODE_00_000_0023", "CODE_00_000_0024", "CODE_00_000_0025", "CODE_00_000_0026", "CODE_00_000_0027", "CODE_00_000_0028", "CODE_00_000_0029", "CODE_00_000_0030", "CODE_00_000_0031", "CODE_00_000_0032", "CODE_00_000_0033", "CODE_00_000_0034", "CODE_00_000_0035", "CODE_00_000_0036", "paysdk_statistic_release"}, k = 1, mv = {1, 8, 0}, xi = 48)
public enum TransactionProcessStatusCodes {
    CODE_00_000_0000("00-000-0000", "启动阶段"),
    CODE_00_000_0001("00-000-0001", "启动阶段-不支持欧盟区域"),
    CODE_00_000_0002("00-000-0002", "启动阶段-输入区域与SDK分包区域不匹配"),
    CODE_00_000_0003("00-000-0003", "启动阶段-启动支付主体"),
    CODE_00_000_0004("00-000-0004", "启动阶段-预下单数据换算-设备安装支付版本不支持预下单"),
    CODE_00_000_0005("00-000-0005", "启动阶段-参数校验失败"),
    CODE_00_000_0006("00-000-0006", "启动阶段-apk未安装-下载支付apk"),
    CODE_00_000_0007("00-000-0007", "启动阶段-apk被禁用"),
    CODE_00_000_0008("00-000-0008", "启动阶段-启动pay-apk失败"),
    CODE_00_000_0009("00-000-0009", "启动阶段-启动msp-apk失败-降级启动pay-apk"),
    CODE_00_000_00010("00-000-0010", "启动阶段-外发暂不支持，请联系MSP团队"),
    CODE_00_000_00011("00-000-0011", "启动阶段-下载支付apk-downloadUrl获取失败"),
    CODE_00_000_00012("00-000-0012", "启动阶段-下载支付apk-文件下载失败"),
    CODE_00_000_0013("00-000-0013", "启动阶段-启动msp-V2-apk失败-降级启动msp v1 apk"),
    CODE_00_000_0014("00-000-0014", "启动阶段-点击下载安全支付对话框触发安全支付下载"),
    CODE_00_000_0015("00-000-0015", "启动阶段-引导下载弹窗曝光"),
    CODE_00_000_0016("00-000-0016", "启动阶段-引导下载完成"),
    CODE_00_000_0017("00-000-0017", "启动阶段-下载支付apk-downloadUrl获取成功"),
    CODE_00_000_0018("00-000-0018", "启动阶段-下载提示框曝光"),
    CODE_00_000_0019("00-000-0019", "启动阶段-文件服务器下载"),
    CODE_00_000_0020("00-000-0020", "启动阶段-软件商店下载"),
    CODE_00_000_0021("00-000-0021", "启动阶段-可选升级弹窗下载按钮点击"),
    CODE_00_000_0022("00-000-0022", "启动阶段-可选升级弹窗曝光"),
    CODE_00_000_0023("00-000-0023", "启动阶段-强制升级弹窗曝光"),
    CODE_00_000_0024("00-000-0024", "启动阶段-强制升级点击"),
    CODE_00_000_0025("00-000-0025", "启动阶段-升级取消广播"),
    CODE_00_000_0026("00-000-0026", "启动阶段-支付结果广播"),
    CODE_00_000_0027("00-000-0027", "启动阶段-应用退后台"),
    CODE_00_000_0028("00-000-0028", "启动阶段-支付结果上报-R1排查"),
    CODE_00_000_0029("00-000-0029", "启动阶段-关闭支付页面回调"),
    CODE_00_000_0030("00-000-0030", "启动阶段-获取路由信息启动失败后降级安全支付"),
    CODE_00_000_0031("00-000-0031", "启动阶段-最终对的路由规则"),
    CODE_00_000_0032("00-000-0032", "启动阶段-宿主信息更新异常"),
    CODE_00_000_0033("00-000-0033", "启动阶段-msp v1 启动失败降级到默认兜底的安全支付"),
    CODE_00_000_0034("00-000-0034", "启动阶段-msp低版本action匹配不上，降级到安全支付兜底策略，忽略MBA校验"),
    CODE_00_000_0035("00-000-0035", "开始支付宿主路由"),
    CODE_00_000_0036("00-000-0036", "联运插件模式不支持，请检查插件是否存在异常");


    @NotNull
    private final String desc;

    @NotNull
    private final String statusCode;

    TransactionProcessStatusCodes(String str, String str2) {
        this.statusCode = str;
        this.desc = str2;
    }

    @NotNull
    public final String getDesc() {
        return this.desc;
    }

    @NotNull
    public final String getStatusCode() {
        return this.statusCode;
    }
}
